Revit 2015 API
Line.Bound Property
Returns the bounded line between the specified points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Release 2014.  Use Line.CreateBound() instead.")]
public static Line this[
	XYZ startPoint,
	XYZ endPoint
] { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Release 2014.  Use Line.CreateBound() instead.")> _
Public Shared ReadOnly Property Bound ( _
	startPoint As XYZ, _
	endPoint As XYZ _
) As Line
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Release 2014.  Use Line.CreateBound() instead.")]
public:
static property Line^ Bound[XYZ^ startPoint, XYZ^ endPoint] {
	Line^ get (XYZ^ startPoint, XYZ^ endPoint);
}
Parameters
startPoint
Type: Autodesk.Revit.DB.XYZ
The start point of the line.
endPoint
Type: Autodesk.Revit.DB.XYZ
The end point of the line.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the specified points are almost equal.
See Also
Line Class
Autodesk.Revit.DB Namespace